package algorithm.infer.array;

/**
 * @Author: hypon
 * @Date: 2019/11/14 15:42
 */
public class GenericArray {


    // 无参构造方法，默认数组容量为10

    // 获取数组容量

    // 获取当前元素个数

    // 判断数组是否为空

    // 修改 index 位置的元素

    // 获取对应 index 位置的元素

    // 查看数组是否包含元素e

    // 获取对应元素的下标, 未找到，返回 -1

    // 在 index 位置，插入元素e, 时间复杂度 O(m+n)
        // 如果当前元素个数等于数组容量，则将数组扩容为原来的2倍

    // 向数组头插入元素

    // 向数组尾插入元素

    // 删除 index 位置的元素，并返回

    // 删除第一个元素

    // 删除末尾元素

    // 从数组中删除指定元素

    // 扩容方法，时间复杂度 O(n)
}
