package algorithm.basic.java8.stream;

/**
 * @Author: hypon
 * @Date: 2019/11/19 18:17
 */
public class Java8StreamPractice {

    /**
     * 1.给定一个数字列表，如何返回一个由每个书的平方构成的列表呢？request:[1,2,3,4,5],return:[1,4,9,16,25]
     */

    /**
     * 2.怎样用map和reduce方法统计流中由多少个Employee
     */

    // 1.找出2011年发生的所有交易，并按照交易额排序（从低到高）
    // 2.交易员都在那些不同的城市工作过？
    // 3.查找所有来自剑桥的交易员，并按姓名排序？
    // 4.返回所有交易员的姓名字符串，按字幕顺序排序
    // 5.有没有交易员是在米兰工作的？
    // 6.打印生活在剑桥的交易员的所有交易额？
    // 7.所有交易中，最高的交易额是多少？
    // 8.找到交易额最小的交易
}
